Tekla.Structures.Model.IGeometryNodeVisitor
The IGeometryNodeVisitor interface is implemented by classes visiting geometry nodes

Tekla.Structures.Model.IGeometryNodeVisitor.Visit(Tekla.Structures.Model.PolygonNode)
Visits a node that is an instance of PolygonNode node
node:

Tekla.Structures.Model.IGeometryNodeVisitor.Visit(Tekla.Structures.Model.CylindricalSurfaceNode)
Visits a node that is an instance of CylindricalSurfaceNode
node:

Tekla.Structures.Model.IGeometryNodeVisitor.Visit(Tekla.Structures.ModelInternal.SpiralNode)
Visits a node that is an instance of HelixNode
node: